Enums/ВидыОперацийРезервовПоОплатеТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыОперацийРезервовПоОплатеТруда</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Начисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Инвентаризация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Списание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Корректировка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ПоказателиРасчетаРезервовПоОплатеТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>ПоказателиРасчетаРезервовПоОплатеТруда</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КраткоеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПоказателя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПоказателейРасчетаЗарплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Точность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСлужебный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособВводаЗначений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыВводаЗначенийПоказателейРасчетаЗарплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/РезервыПоОплатеТрудаРасширенныйПовтИсп/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Получает информацию о виде расчета резерва.
Функция ПолучитьИнформациюОВидеРасчетаРезерва(ВидРасчета) Экспорт
	
	ВидыРасчетаИнфо = РезервыПоОплатеТрудаРасширенный.ИнформацияОВидахРасчетаРезервов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВидРасчета));
	
	ВидРасчетаИнфо = ВидыРасчетаИнфо[ВидРасчета];
	
	Если ВидРасчетаИнфо = Неопределено Тогда 
		ЗапрашиваемыеДанныеСтрока = РезервыПоОплатеТрудаРасширенный.ЗапрашиваемыеДанныеВидаРасчетаРезерва();
		ВидРасчетаИнфо = Новый Структура(ЗапрашиваемыеДанныеСтрока);
		ВидРасчетаИнфо.Вставить("Показатели", Новый Массив);
	КонецЕсли;
	
	Возврат ВидРасчетаИнфо;
	
КонецФункции

// Получает информацию о виде расчета.
Функция ПолучитьИнформациюОВидеРасчета(ВидОперации, СтрокаКоллекции, ОписаниеТаблицы) Экспорт
	
	Если ВидОперации = Перечисления.ВидыОперацийРезервовПоОплатеТруда.Инвентаризация Тогда
		ИнфоОВидеРасчета = ЗарплатаКадрыРасширенныйПовтИсп.ПолучитьИнформациюОВидеРасчета(
					СтрокаКоллекции[ОписаниеТаблицы.ИмяРеквизитаВидРасчета]);
	Иначе
		ИнфоОВидеРасчета = ПолучитьИнформациюОВидеРасчетаРезерва(
			СтрокаКоллекции[ОписаниеТаблицы.ИмяРеквизитаВидРасчетаРезерва]);
	КонецЕсли;
	
	Возврат ИнфоОВидеРасчета;
	
КонецФункции

// Находит элемент справочника «Показатели расчета зарплаты» по значению реквизита Идентификатор.
//
// Параметры:
//	- Идентификатор - строка с указанием идентификатора показателя.
//	- УчитыватьРегистр - булево, по умолчанию Ложь, если Истина, то соответствие будет регистрозависимым.
//
// Возвращаемое значение - ссылка на показатель или Неопределено, если показатель не найден.
//
Функция ПоказательПоИдентификатору(Идентификатор, УчитыватьРегистр = Ложь) Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ПоказателиРасчетаРезервовПоОплатеТруда.Ссылка
	|ИЗ
	|	Справочник.ПоказателиРасчетаРезервовПоОплатеТруда КАК ПоказателиРасчетаРезервовПоОплатеТруда
	|ГДЕ
	|	(ПоказателиРасчетаРезервовПоОплатеТруда.Идентификатор = &Идентификатор
	|			ИЛИ ПоказателиРасчетаРезервовПоОплатеТруда.ИдентификаторСлужебный = &ИдентификаторСлужебный)";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	Запрос.УстановитьПараметр("ИдентификаторСлужебный", ВРег(Идентификатор));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Получает информацию об одном показателе расчета зарплаты
// с использованием метода 
// ЗарплатаКадрыРасширенный.СведенияОПоказателяхРасчетаЗарплаты.
//
// Параметры:
//	- Показатель - показатель расчета зарплаты.
//
Функция СведенияОПоказателеРасчетаРезервов(Показатель) Экспорт
	
	Если Не ЗначениеЗаполнено(Показатель) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат РезервыПоОплатеТрудаРасширенный.СведенияОПоказателяхРасчетаРезервов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Показатель))[Показатель];
	
КонецФункции

// Получает информацию о виде расчета для вида расчета резерва
// Параметры:
//	- ВидРасчетаРезерва - СправочникСсылка.ВидыРасчетовРезервовПоОплатеТруда
//
Функция НачислениеВидаРасчетаРезерва(ВидРасчетаРезерва) Экспорт
	
	Возврат РезервыПоОплатеТрудаРасширенный.НачислениеВидаРасчетаРезерва(ВидРасчетаРезерва);
	
КонецФункции

#КонецОбласти
